IDEA Open Model
CrossSectionFactory.FillWelded2Lu Method
Compatible with IDEA StatiCa v 10.1
 Fill steel section Lu shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public static void FillWelded2Lu(
	CrossSectionParameter cssO,
	string name,
	double Distance
)
Public Shared Sub FillWelded2Lu (
	cssO As CrossSectionParameter,
	name As String,
	Distance As Double
)
public:
static void FillWelded2Lu(
	CrossSectionParameter^ cssO,
	String^ name,
	double Distance
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name
Type: System.String
Name
Distance
Type: System.Double
Distance
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace